{
"What is the network port for FTP (data channel)?": "tcp/20",
"What is the network port for FTP (control channel)?": "tcp/21",
"What is the network port for FTPS (data channel)?": "tcp/989",
"What is the network port for FTPS (control channel)?": "tcp/990",
"What is the network port for SSH?": "tcp/22",
"What is the network port for Telnet?": "tcp/23",
"What is the network port for SMTP (unsecure)?": "tcp/25",
"What is the network port for SMTP (secure)?": "tcp/587",
"What is the network port for IMAP (unsecure)?": "tcp/143",
"What is the network port for IMAP (secure)?": "tcp/993",
"What is the network port for POP3 (unsecure)?": "tcp/110",
"What is the network port for POP3 (secure)?": "tcp/995",
"What is the network port for DNS?": "udp/53",
"What is the network port for DHCP (server)?": "udp/67",
"What is the network port for DHCP (client)?": "udp/68",
"What is the network port for HTTP?": "tcp/80",
"What is the network port for HTTPS?": "tcp/443",
"What is the network port for SMB using NETBIOS name services (nbname)?": "udp/137",
"What is the network port for SMB using NETBIOS session services (nbsession)?": "tcp/139",
"What is the network port for SMB direct (NETBIOS-less)": "tcp/445",
"What is the network port for SNMP (Queries)?": "udp/161",
"What is the network port for SNMP (Traps)?": "udp/162",
"What is the network port for LDAP (unsecure)?": "tcp/389",
"What is the network port for LDAP (secure - tcp/udp)?": "636",
"What is the network port for RDP?": "tcp/3389",
"How many pins does a SODIMM DDR3 module have?": "204",
"How many pins does a SODIMM DDR4 module have?": "260",
"For two computers to communicate, they must both use the same ________.": "protocol",
"____ sends email": "SMTP",
"What does SMTP stand for?": "Simple Mail Transfer Protocol",
"___ allows computers to transfer files back and forth.": "FTP",
"What does FTP stand for?": "File Transfer Protocol",
"___ enables the remote control of computers and enables data to be exchanged between computers on a secured channel.": "SSH",
"What does SSH stand for?": "Secure Shell",
"______ provides remote access to other hosts using the command-line interface (CLI).": "Telnet",
"What does Telnet stand for?": "Telecommunication network",
"____ is used to automatically assign IP addresses to hosts.": "DHCP",
"What does DHCP stand for?": "Dynamic Host Configuration Protocol",
"It is better in many situations for servers and printers to use ______ addresses so you know exactly what the address is and so it won’t change.": "static",
"By default, in a typical IPv4 network, the DHCP server needs to have inbound port __ open.": "67",
"In a typical IPv4 network, a DHCP client uses port __ to connect out to the DHCP server.": "68",
"What is the network port for DHCPv6 (server)": "udp/547",
"What is the network port for DHCPv6 (client)": "udp/546",
"DHCP is also sometimes referred to as BOOTP - short for _________ ________.": "Bootstrap Protocol",
"___ is the group of servers on the Internet that translates domain names to IP addresses.": "DNS",
"What does DNS stand for?": "Domain Name System",
"____ is used to access and maintain distributed directories of information (such as the kind involved with Microsoft domains). Microsoft refers to this a Active Directory (AD), and also directory services or domain services.": "LDAP",
"What does LDAP stand for?": "Lightweight Directory Access Protocol",
"To facilitate connections to remote computers and allow full remote control, Microsoft uses the Remote Desktop Connection program, which is based on ___.": "RDP",
"What does RDP stand for?": "Remote Desktop Protocol",
"The ___ protocol provides access to shared items such as files and printers.": "SMB",
"What does SMB stand for?": "Server Message Block",
"____ is used as the standard for managing and monitoring devices on a network.": "SNMP",
"What does SNMP stand for?": "Simple Network Management Protocol",
"A ______ is a central connecting device that computers connect to in a wired fashion.": "switch",
"A _______ switch can allow an admin to control settings and network traffic.": "managed",
"An _________ switch simply allows LAN devices to communicate without user intervention.": "unmanaged",
"A ______ is used to connect two or more networks to form an internetwork.": "router",
"A ___ enables data communications over the air when a computer is equipped with a wireless networking adapter.": "WAP",
"What does WAP stand for?": "Wireless Access Point",
"A ___ is responsible for transmitting data between two or more wireless computers, usually at 6 GHz, 5 GHz, or 2.4 GHz frequencies.": "WAP",
"A ________ is a hardware appliance or software application that protects a computer from unwanted intrusion.": "firewall",
"A ___ is an expansion card or motherboard interface that enables a PC to connect to a network via a network cable.": "NIC",
"What does NIC stand for?": "Network Interface Card",
"The ___ is the original connecting device for computers on a LAN. It creates a simple shared physical connection that all computers use to send data.": "hub",
"A _____ _____ is a physical hardware device that acts as a termination point for all of the network cables in a building.": "patch panel",
"___ is an Ethernet standard that allows for the passing of electrical power in addition to data over Ethernet cabling.": "PoE",
"What does PoE stand for?": "Power over Ethernet",
"Regarding PoE technology: This could be a switch or other similar device.": "PSE",
"What does PSE stand for in PoE technologies?": "Power sourcing equipment",
"Regarding PoE technology: This could be an IP-based camera, an IP phone, a wireless access point, a router, a mini network switch, an industrial device, a lighting controller, and more.": "PD",
"What does PD stand for in PoE technologies": "Powered device",
"Essentially, a cable or DSL _____ is a device that allows a computer (or SOHO network) to access the Internet.": "modem",
"A ___ is a device installed at the perimeter of a customer’s premises. It is the connection point between a provider’s cabling and the customer’s cabling—also known as a demarcation point, or demarc.": "NID",
"What does NID stand for?": "Network Interface Device",
"___ is a type of centralized network management that is dynamic and programmable.": "SDN",
"What does SDN stand for?": "Software defined networking",
"____ is a wireless technology used to read information that is stored on tags that can be attached to, or embedded in, just about anything.": "RFID",
"What does RFID stand for?": "Radio frequency identification",
"What 802.11 standard is this: Maximum data rate: 54 mbps; Frequency: 5 GHz": "802.11a",
"What 802.11 standard is this: Maximum data rate: 11 mbps; Frequency: 2.4 GHz": "802.11b",
"What 802.11 standard is this: Maximum data rate: 54 mbps; Frequency: 2.4 GHz": "802.11g",
"What 802.11 standard is this: Maximum data rate: 600 mbps; Frequency: 5 and/or 2.4 GHz": "802.11n",
"What 802.11 standard is this: Maximum data rate: 3.5 gbps; Frequency: 5 GHz": "802.11ac",
"What 802.11 standard is this: Maximum data rate: 9.6 gbps; Frequency: 5 and 2.4 GHz": "802.11ax",
"What is another name for 802.11n?": "Wi-Fi 4",
"What is another name for 802.11ac": "Wi-Fi 5",
"What frequency does Bluetooth use?": "2.4 GHz"
}