{
"What is the network port for FTP (data channel)?": "tcp/20",
"What is the network port for FTP (control channel)?": "tcp/21",
"What is the network port for FTPS (data channel)?": "tcp/989",
"What is the network port for FTPS (control channel)?": "tcp/990",
"What is the network port for SSH?": "tcp/22",
"What is the network port for Telnet?": "tcp/23",
"What is the network port for SMTP (unsecure)?": "tcp/25",
"What is the network port for SMTP (secure)?": "tcp/587",
"What is the network port for IMAP (unsecure)?": "tcp/143",
"What is the network port for IMAP (secure)?": "tcp/993",
"What is the network port for POP3 (unsecure)?": "tcp/110",
"What is the network port for POP3 (secure)?": "tcp/995",
"What is the network port for DNS?": "udp/53",
"What is the network port for DHCP (server)?": "udp/67",
"What is the network port for DHCP (client)?": "udp/68",
"What is the network port for HTTP?": "tcp/80",
"What is the network port for HTTPS?": "tcp/443",
"What is the network port for SMB using NETBIOS name services (nbname)?": "udp/137",
"What is the network port for SMB using NETBIOS session services (nbsession)?": "tcp/139",
"What is the network port for SMB direct (NETBIOS-less)": "tcp/445",
"What is the network port for SNMP (Queries)?": "udp/161",
"What is the network port for SNMP (Traps)?": "udp/162",
"What is the network port for LDAP (unsecure)?": "tcp/389",
"What is the network port for LDAP (secure - tcp/udp)?": "636",
"What is the network port for RDP?": "tcp/3389",
"How many pins does a SODIMM DDR3 module have?": "204",
"How many pins does a SODIMM DDR4 module have?": "260",
"How many pins does a SODIMM DDR5 module have?": "262",
"For two computers to communicate, they must both use the same ________.": "protocol",
"____ sends email": "SMTP",
"What does SMTP stand for?": "Simple Mail Transfer Protocol",
"___ allows computers to transfer files back and forth.": "FTP",
"What does FTP stand for?": "File Transfer Protocol",
"___ enables the remote control of computers and enables data to be exchanged between computers on a secured channel.": "SSH",
"What does SSH stand for?": "Secure Shell",
"______ provides remote access to other hosts using the command-line interface (CLI).": "Telnet",
"What does Telnet stand for?": "Telecommunication network",
"____ is used to automatically assign IP addresses to hosts.": "DHCP",
"What does DHCP stand for?": "Dynamic Host Configuration Protocol",
"It is better in many situations for servers and printers to use ______ addresses so you know exactly what the address is and so it won’t change.": "static",
"By default, in a typical IPv4 network, the DHCP server needs to have inbound port __ open.": "67",
"In a typical IPv4 network, a DHCP client uses port __ to connect out to the DHCP server.": "68",
"What is the network port for DHCPv6 (server)": "udp/547",
"What is the network port for DHCPv6 (client)": "udp/546",
"DHCP is also sometimes referred to as BOOTP - short for _________ ________.": "Bootstrap Protocol",
"___ is the group of servers on the Internet that translates domain names to IP addresses.": "DNS",
"What does DNS stand for?": "Domain Name System",
"____ is used to access and maintain distributed directories of information (such as the kind involved with Microsoft domains). Microsoft refers to this a Active Directory (AD), and also directory services or domain services.": "LDAP",
"What does LDAP stand for?": "Lightweight Directory Access Protocol",
"To facilitate connections to remote computers and allow full remote control, Microsoft uses the Remote Desktop Connection program, which is based on ___.": "RDP",
"What does RDP stand for?": "Remote Desktop Protocol",
"The ___ protocol provides access to shared items such as files and printers.": "SMB",
"What does SMB stand for?": "Server Message Block",
"____ is used as the standard for managing and monitoring devices on a network.": "SNMP",
"What does SNMP stand for?": "Simple Network Management Protocol",
"A ______ is a central connecting device that computers connect to in a wired fashion.": "switch",
"A _______ switch can allow an admin to control settings and network traffic.": "managed",
"An _________ switch simply allows LAN devices to communicate without user intervention.": "unmanaged",
"A ______ is used to connect two or more networks to form an internetwork.": "router",
"A ___ enables data communications over the air when a computer is equipped with a wireless networking adapter.": "WAP",
"What does WAP stand for?": "Wireless Access Point",
"A ___ is responsible for transmitting data between two or more wireless computers, usually at 6 GHz, 5 GHz, or 2.4 GHz frequencies.": "WAP",
"A ________ is a hardware appliance or software application that protects a computer from unwanted intrusion.": "firewall",
"A ___ is an expansion card or motherboard interface that enables a PC to connect to a network via a network cable.": "NIC",
"What does NIC stand for?": "Network Interface Card",
"The ___ is the original connecting device for computers on a LAN. It creates a simple shared physical connection that all computers use to send data.": "hub",
"A _____ _____ is a physical hardware device that acts as a termination point for all of the network cables in a building.": "patch panel",
"___ is an Ethernet standard that allows for the passing of electrical power in addition to data over Ethernet cabling.": "PoE",
"What does PoE stand for?": "Power over Ethernet",
"Regarding PoE technology: This could be a switch or other similar device.": "PSE",
"What does PSE stand for in PoE technologies?": "Power sourcing equipment",
"Regarding PoE technology: This could be an IP-based camera, an IP phone, a wireless access point, a router, a mini network switch, an industrial device, a lighting controller, and more.": "PD",
"What does PD stand for in PoE technologies?": "Powered device",
"Essentially, a cable or DSL _____ is a device that allows a computer (or SOHO network) to access the Internet.": "modem",
"A ___ is a device installed at the perimeter of a customer’s premises. It is the connection point between a provider’s cabling and the customer’s cabling—also known as a demarcation point, or demarc.": "NID",
"What does NID stand for?": "Network Interface Device",
"___ is a type of centralized network management that is dynamic and programmable.": "SDN",
"What does SDN stand for?": "Software defined networking",
"____ is a wireless technology used to read information that is stored on tags that can be attached to, or embedded in, just about anything.": "RFID",
"What does RFID stand for?": "Radio frequency identification",
"What 802.11 standard is this: Maximum data rate: 54 mbps; Frequency: 5 GHz": "802.11a",
"What 802.11 standard is this: Maximum data rate: 11 mbps; Frequency: 2.4 GHz": "802.11b",
"What 802.11 standard is this: Maximum data rate: 54 mbps; Frequency: 2.4 GHz": "802.11g",
"What 802.11 standard is this: Maximum data rate: 600 mbps; Frequency: 5 and/or 2.4 GHz": "802.11n",
"What 802.11 standard is this: Maximum data rate: 3.5 gbps; Frequency: 5 GHz": "802.11ac",
"What 802.11 standard is this: Maximum data rate: 9.6 gbps; Frequency: 5 and 2.4 GHz": "802.11ax",
"What is another name for 802.11n?": "Wi-Fi 4",
"What is another name for 802.11ac?": "Wi-Fi 5",
"What is another name for 802.11ax?": "Wi-Fi 6",
"What frequency does Bluetooth use?": "2.4 GHz",
"____ servers store, transfer, migrate, synchronize, and archive files.": "File",
"A ___ server houses the website of an organization.": "web",
"_____ servers are basic servers that take control of multiple printers on the network.": "Print",
"Networked host or server that provides e-mail service.": "Mail server",
"A _____ server is used primarily as a go-between for a client and the website accessed.": "proxy",
"The ____ server is in charge of handing out IP addresses to clients.": "DHCP",
"A ___ server takes care of resolving domain names to IP addresses. ": "DNS",
"A ___ server resolves hostnames to IP addresses and vice versa.": "DNS",
"______ is a protocol that can take logged event information from a router or other network device and send it to a logging server—also known as a syslog server.": "Syslog",
"In the computer security world, AAA stands for ______________, _____________, and __________.": "authentication authorization accounting",
"Providing robust network security by integrating traditional firewalls with many other security services such as IPS, VPN, load balancing, anti-malware, and more.": "UTM",
"What does UTM stand for?": "Unified Threat Management",
"Application that inspects packets, looking for active intrusions. Functions inside the network, looking for threats a firewall might miss, such as viruses, illegal logon attempts, and other well-known attacks. May also discover threats from inside the network, such as a vulnerability scanner run by a rogue employee.": "IDS",
"What does IDS stand for?": "Intrusion Detection System",
"Application similar to an intrusion detection system (IDS), except that it sits directly in the flow of network traffic. This enables it to stop ongoing attacks itself, but may also slow down the network and be a single point of failure.": "IPS",
"What does IPS stand for in security?": "Intrusion Prevention System",
"Software used to filter incoming e-mail to prevent spam.": "Spam gateway",
"A device that spreads network traffic across multiple servers in order to improve availability of resources.": "load balancer",
"________ _______ are devices that have integrated CPU and RAM and can process information internally without the need for a controlling system.": "Embedded systems",
"The ___ is a global network of physical objects that have embedded processors (of some sort) that can communicate with computers across the Internet.": "IoT",
"What does IoT stand for?": "Internet of Things",
"Feature of Windows that automatically assigns an IP address to the system when the client cannot obtain an IP address automatically.": "APIPA",
"What does APIPA stand for?": "Automatic Private IP Addressing",
"_______ IP addresses are internal to your network and do not communicate directly with the Internet.": "Private",
"A ______ IP address is an address that communicates directly with the Internet.": "public",
"Enter the format for a Class A private IP address.": "10.x.x.x",
"Enter the format for a Class B private IP address.": "172.16-31.x.x",
"Enter the format for a Class C private IP address.": "192.168.x.x",
"Name the format for this range of private IP addresses: 10.0.0.0–10.255.255.255:": "Class A",
"Name the format for this range of private IP addresses: 172.16.0.0–172.31.255.255:": "Class B",
"Name the format for this range of private IP addresses: 192.168.0.0–192.168.255.255:": "Class C",
"What is the lower bound for an APIPA address assignment?": "169.254.1.0",
"What is the upper bound for an APIPA address assignment?": "169.254.254.255",
"What is the loopback address (IPv4)?": "127.0.0.1",
"____-_____ is another term for APIPA.": "link local",
"What is the loopback address (IPv6)?": "::1",
"Hostname + Domain name = ____": "FQDN",
"What does FQDN stand for?": "fully qualified domain name",
"(DNS record question): Stores the IPv4 address of a domain or host for forward lookup (name to IP address). Example on a DNS server: server1.example.com A 10.0.2.4": "A record",
"(DNS record question): Stores the IPv6 address of a domain or host.": "AAAA record",
"(DNS record question): Stores the DNS server record.": "NS record",
"What does NS record stand for?": "Name Server record",
"(DNS record question): Stores the administrative information for a domain.": "SOA record",
"What does SOA record stand for?": "Start of Authority record",
"(DNS record question): Directs mail to an email server. Example on a DNS server: example.com. 1936 IN MX 10 mail.example.com.": "MX record",
"What does MX record stand for?": "Mail Exchange record",
"(DNS record question): Does reverse lookup (IP to name). Example on a DNS server: 4.2.0.10.in-addr.arpa. PTR server1.example.com.": "PTR record",
"What does PTR record stand for?": "Pointer record",
"(DNS record question): Used for administrative text-based notes and with email authentication methods.": "TXT record",
"____ is an authentication method for email that attempts to detect email spoofers. ____ enables the email recipient to check the domain that an email supposedly came from using a digital signature.": "DKIM",
"What does DKIM stand for?": "Domain Keys Identified Mail",
"___ also detects email spoofers. A receiving email server can attempt to check mail by verifying the IP address of the domain that the mail claims to have come from.": "SPF",
"What does SPF stand for?": "Sender Policy Framework",
"This email authentication protocol helps protect email domains from spoofing and other unauthorized use. It is used in conjunction with the older DKIM and/or SPF methods, which by themselves are less potent solutions": "DEMARC",
"What is the 1st step to the DHCP Process?": "Discovery",
"What is the 2nd step to the DHCP Process?": "Offering",
"What is the 3rd step to the DHCP Process?": "Request",
"What is the 4th step to the DHCP Process?": "Acknowledgment",
"____ ____________ are IP addresses within the DHCP scope that are permanently reserved for special computers/devices that need to use DHCP but don’t want the IP address to change over time (which can happen periodically in DHCP environments).": "DHCP reservations",
"A ____ is implemented primarily to segment a network. But it can also be used to reduce data collisions, organize the network, potentially boost performance, and, possibly, increase security.": "VLAN",
"What does VLAN stand for?": "Virtual Local Area Network",
"Encrypted connection over the Internet between a computer or remote network and a private network.": "VPN",
"What does VPN stand for?": "Virtual Private Network",
"A ___ is a group of computers and other devices usually located in a small area: a house, a small office, or a single building.": "LAN",
"What does LAN stand for?": "local area network",
"A LAN is usually based on a network design called the ____, or hub-and-spoke, topology, where all hosts connect to a central connecting device such as a switch, an access point, or a SOHO router.": "star",
"A ___ is a group of one or more LANs over a large geographic area. Let’s say a company has two LANs: one in New York and one in Los Angeles. Connecting the two would result in a ___.": "WAN",
"802.11 network that covers a single city.": "MAN",
"What does MAN stand for?": "metropolitan area network",
"A ___ is a dedicated network designed specifically for the storage of data.": "SAN",
"What does SAN stand for?": "storage area network",
"A ____ is really a subdivision of a LAN. A ____ is formed when multiple computers are connected by way of one or more wireless access points.": "WLAN",
"What does WLAN stand for?": "Wireless Local Area Network",
"A hybrid wireless topology in which most nodes connect in a mesh network while also including some wired machines. Nodes act like routers; they forward traffic for other nodes, but without wires.": "WMN",
"What does WMN stand for?": "Wireless Mesh Network",
"A ___ is a smaller computer network used for communication by small computing devices. Take this to the next level by adding wireless standards such as Bluetooth, wireless USB, NFC, Zigbee, or Z-Wave, and you get a wireless ___ (w___).": "PAN",
"What does PAN stand for?": "Personal Area Network",
"What does WPAN stand for?": "Wireless Personal Area Network",
"Know that cable Internet connections use ____ coaxial cable and F-connectors to the cable modem.": "RG-6",
"Know that cable Internet connections use RG-6 coaxial cable and ____________ to the cable modem.": "F-connectors",
"A specialized tool for connecting UTP wires to a punchdown block.": "punchdown tool",
"Device for verifying that the connectors and wires in a cable (such as UTP) are in good order.": "cable tester",
"Generic term for two devices used together—a tone generator and a tone probe (locator)—to trace cables by sending an electrical signal along a wire at a particular frequency. The tone probe then emits a sound when it distinguishes that frequency.": "toner",
"A specialized tool for connecting network cables to a connector, such as twisted pair wires to an RJ-45 connector or coaxial cable to an RG-6 connector.": "crimper",
"A _______ ___ is a physical device used to capture and copy data packets for analysis.": "network tap",
"A _____ ________ is a tool that can identify wireless networks—typically on 2.4 GHz and 5 GHz frequencies. This tool shows things such as the channels used by neighboring wireless networks, any overlap that might be occurring between those networks and yours, and the signal strength of access points.": "Wi-Fi analyzer",
"A _____ ________ is a tool that can identify wireless networks and the channels/frequencies they use.": "Wi-fi analyzer",
"Label the UTP cable that satisfies the following specifications: 100 Mbps networks (100 MHz).": "Cat 5",
"Label the UTP cable that satisfies the following specifications: 100 Mbps and 1 Gbps networks (100 MHz/350 MHz).": "Cat 5e",
"Label the UTP cable that satisfies the following specifications: 1000 Mbps (1 Gbps) and 10 Gbps networks (250 MHz/500 MHz).": "Cat 6/6a",
"What is the data transfer rate for USB 2.0?": "480 mbps",
"What is the data transfer rate for USB 3.0?": "5 gbps",
"What is the data transfer rate for USB 3.1?": "10 gbps",
"What is the data transfer rate for USB 3.2 (USB-C)?": "10/20 gbps",
"_________ is a proprietary port built into Apple devices such as the iPad and iPhone. It’s an 8-pin connector that replaced the (now legacy) 30-pin dock predecessor.": "Lightning",
"___________ is a high-speed hardware interface developed by Intel. As of the writing of this book, this is used primarily by Apple computers. It combines elements of PCI Express and DisplayPort technologies.": "Thunderbolt",
"What is the data transfer rate for Thunderbolt (v1)?": "10 gbps",
"What is the data transfer rate for Thunderbolt (v2)?": "20 gbps",
"What is the data transfer rate for Thunderbolt (v3)?": "40 gbps",
"What is the connector type for Thunderbolt (v1)?": "DisplayPort",
"What is the connector type for Thunderbolt (v2)?": "DisplayPort",
"What is the connector type for Thunderbolt (v3)?": "USB-C",
"What is the required version PCIe for Thunderbolt (v1)?": "2.0",
"What is the required version PCIe for Thunderbolt (v2)?": "2.0",
"What is the required version PCIe for Thunderbolt (v3)?": "3.0",
"A very common connection for internal drives (____) and external drives (e____). It uses a 7-pin data connector and a 15-pin power connector.": "SATA",
"What does SATA stand for?": "serial advanced technology attachment",
"A much older type of connection that runs in parallel (8 bits at a time) instead of serially (1 bit at a time). It uses a 40-pin ribbon cable for data and a 4-pin Molex connector for power. (The chances of seeing this type of connector are slim.)": "IDE",
"What does IDE stand for?": "integrated drive electronics",
"Around since the 1980s, ____ at first was designed as a parallel technology that could run faster than IDE and other connections. Today, a common type of ____ is Serial Attached ____ (SAS), which can transfer data as fast as 22.5 Gbps (SAS version 4); faster speeds are being developed.": "SCSI",
"What does SCSI stand for?": "small computer system interface",
"How many pins does a DDR3 DIMM have?": "240",
"How many pins does a DDR4 DIMM have?": "288",
"How many pins does a DDR5 DIMM have?": "288",
"Know that ___ RAM can prevent data loss and potential system crashes by automatically correcting memory errors.": "ECC",
"Portion of the hard drive set aside by an OS to act like RAM when the system needs more RAM than is installed. A file containing this data is typically called a page file in Windows and a swap file in UNIX platforms like Linux and macOS.": "virtual memory",
"What does DOCSIS stand for?": "Data Over Cable Service Interface Specification",
"What does LC stand for in fiber connections?": "Local connector",
"What does ST stand for in fiber connections?": "Straight tip",
"What does SC stand for in fiber connections?": "Subscriber connector",
"____ is a serial bus communication interface used to move data to and from storage drives": "SATA",
"For power, a SATA drive utilizes a __-___ power connector": "15 pin",
"What SATA version has a maximum data of 6 Gb/s and a transfer rate of 600 MB/s": "3.0",
"What SATA version has a maximum data of 16 Gb/s and a transfer rate of 1969 MB/s": "3.2",
"____ technologies are designed to either increase the speed of reading and writing data or to create one of several types of fault-tolerant volumes—or both.": "RAID",
"What does RAID stand for?": "Redundant array of independent disks",
"To create a RAID array, you need ___ or more drives.": "two",
"(RAID question): Striping. Data is striped across multiple disks in an effort to increase performance.": "RAID 0",
"(RAID question): Mirroring. Data is copied to two identical disks. If one disk fails, the other continues to operate. When each disk is connected to a separate controller, this is known as disk duplexing. See Figure 15.2 for an illustration.": "RAID 1",
"(RAID question) Striping with parity. Data is striped across multiple disks; the fault-tolerant parity data is also written to each disk. If one disk fails, the array can reconstruct the data from the parity information. See Figure 15.3 for an illustration.": "RAID 5",
"(RAID question) Combines the advantages of RAID 1 and RAID 0. Requires a minimum of four or more disks. The system contains at least two mirrored disks that are then striped. Also known as 'stripe of mirrors.'": "RAID 10",
"(Yes/No) Is RAID 0 fault tolerant?": "No",
"(Yes/No) Is RAID 1 fault tolerant?": "Yes",
"(Yes/No) Is RAID 5 fault tolerant?": "Yes",
"(Yes/No) Is RAID 10 fault tolerant?": "Yes",
"What is the mininmum number of disks neede for RAID 0?": "2",
"What is the mininmum number of disks neede for RAID 1 (strictly how many allowed)?": "2",
"What is the mininmum number of disks neede for RAID 5?": "3",
"What is the mininmum number of disks neede for RAID 10?": "4",
"If a motherboard does not have a necessary integrated component, you will have to add an _________ ____ to a PCIe slot.": "expansion card",
"The ____ is essentially a piece of code that the BIOS runs to find out which type of processor is on the motherboard and verify the amount of RAM. It also identifies buses on the motherboard (and other devices) as well as which devices are available for booting.": "POST",
"What does POST stand for?": "power on self test",
"The _____ ____ is the frequency (or speed) of a component.": "clock rate",
"Many motherboards allow for ____________ , which enables the user to increase the base clock within the BIOS, thereby increasing the clock speed of the CPU.": "overclocking",
"___ technology is typically found in smartphones, tablets, and other mobile devices.": "ARM",
"What does ARM stand for within the context of CPUs?": "Advanced RISC Machine",
"_____-_________ enables a single-core CPU to calculate two instruction sets simultaneously": "Multi threading",
"The ______ is the electrical interface between the CPU and the motherboard.": "socket",
"___ sockets accept CPUs that have pins covering the majority of their underside.": "PGA",
"What does PGA stand for within the context of CPUs?": "Pin Grid Array",
"___ sockets use lands that protrude out and touch the CPU’s contact points.": "LGA",
"What does LGA stand for within the context of CPUs?": "Land Grid Array",
"___ signifies the amount of heat generated by the CPU, which the cooling system is required to dissipate when operating with a complex workload.": "TDP",
"What does TDP stand for within the context of CPUs?": "thermal design power",
"A ____ ____ is a block of metal made to sit right on top of the CPU, with metal fins stretching away from the CPU.": "heat sink"
}