{
"Which edition of Windows 10 has the following characteristics?: \nRam Limitation: 128 GB (x64) 4 GB (x86)\nPhysical CPU Support: 1\nRemote Desktop Protocol (client only)\nDomain Access: NO\nEFS and bitlocker: NO\nHyper-V: NO\nGroup Policy Editor (gpedit.msc): NO": "Windows 10 Home",
"Which edition of Windows 10 has the following characteristics?: \nRam Limitation: 2 TB (x64) 4 GB (x86)\nPhysical CPU Support: 2\nRemote Desktop Protocol (client and server)\nDomain Access: YES\nEFS and bitlocker: YES\nHyper-V: YES\nGroup Policy Editor (gpedit.msc): YES": "Windows 10 Pro",
"Which edition of Windows 10 has the following characteristics?: \nRam Limitation: 6 TB (x64) 4 GB (x86)\nPhysical CPU Support: 4\nRemote Desktop Protocol (client and server)\nDomain Access: YES\nEFS and bitlocker: YES\nHyper-V: YES\nGroup Policy Editor (gpedit.msc): YES": "Windows 10 Pro for Workstations and Windows 10 Enterprise",
"_____ are the little clickable pictures you see on the desktop.": "Icons",
"This is the main menu that is launched from the Start button.": "Start Menu",
"This bar spans the bottom of the desktop. It houses the Start button, Quick Launch, any open applications, and the notification area (where applicable).": "Taskbar",
"To the far right of the taskbar is the ____________ ____, which houses the clock, volume control, network icon, battery power indicator, and so on.": "notification area",
"Enter the command that executes the following action: enables you to move from one directory to another.": "cd",
"Enter the command that executes the following action: create directories.": "md",
"Enter the command that executes the following action: enables you to remove directories.": "rd",
"Enter the command that executes the following action: moves you up one directory.": "cd ..",
"Enter the command that executes the following action: takes you directly to the top (root) of the volume that you are working in.": "cd \\",
"Enter the command that executes the following action: find out what volumes you have on your system.": "wmic logicaldisk get name",
"Enter the command that executes the following action: when used alone, it displays the contents of the current directory. But it can be configured to show information in any other directory.": "dir",
"Enter the command that executes the following action: shows all the directories and subdirectories at your current position. Be careful where you run this command because it could list information for quite a while and cause some stress on the storage drive.": "tree",
"Enter the command that executes the following action: allows you to copy one or more files to another location.": "copy",
"Enter the command that executes the following action: meant to copy large amounts of data from one location to another; it even makes exact copies of entire directory trees.": "xcopy",
"Enter the command that executes the following action: meant to copy directories that contain lots of data, and it can even mirror complete directory trees from one computer to another. This is the successor to xcopy.": "robocopy",
"Enter the command that executes the following action: when you are done with a file and are ready to delete it.": "del",
"Enter the command that executes the following action: this utility is the command-line counterpart of the Windows Disk Management program.": "diskpart",
"Enter the command that executes the following action: you use this command to format storage media to a particular file system, such as NTFS, FAT, or FAT32.": "format",
"Enter the command that executes the following action: this is the command-line version of Disk Defragmenter.": "defrag",
"Enter the command that executes the following action: to analyze a drive.": "defrag -a",
"Enter the command that executes the following action: checks a drive, fixes basic issues like lost files, and displays a status report; it can also fix some errors on the drive with the addition of the /F switch.": "chkdsk",
"Enter the command that executes the following action: scans all protected files immediately and repairs files.": "sfc /scannow",
"Enter the command that executes the following action: scans the integrity of files but does not perform a repair.": "sfc /verifyonly",
"Enter the command that executes the following action: fixes errors on a drive.": "chkdsk /F",
"Enter the command that executes the following action: brings up a window that tells you what operating system you are running, the edition, and the build number.": "winver",
"Enter the command that executes the following action: displays the Windows version.": "ver",
"Enter the command that executes the following action: used to turn off a computer, restart it, send it to hibernate mode, log a person off, and so on.": "shutdown",
"Enter the command that executes the following action: updates multiple Group Policy settings.": "gpupdate",
"Enter the command that executes the following action: displays the Resultant Set of Policy (RSoP) information for a target user and computer.": "gpresult",
"Command-line utility for Windows servers and workstations that displays the current TCP/IP configuration of the machine. Similar to ip in Linux.": "ipconfig",
"This command releases the current IP address.": "ipconfig /release",
"This command renews the IP address after being released.": "ipconfig /renew",
"If you're havizng DNS issues (for example, problems connecting to websites), you can erase the DNS cache by typing what?": "ipconfig /flushdns",
"_______ is the time it takes for sent data packets to be received by a remote computer.": "latency",
"____ tests whether another host is available over the network. Using this command is an easy way to see if another host is \"alive\". It can also be used to spot DNS issues, latency problems, and to test whether a computer has TCP/IP installed properly, even if it isn't wired to the network.": "ping",
"Enter the command that pings the host until the command is stopped (e.g., by Ctrl + C).": "ping -t",
"Enter the command that pings a host a specific number of times.": "ping -n",
"Enter the command that pings 192.168.0.1 20 times.": "ping -n 20 192.168.0.1",
"Enter the command that pings the host such that you are able to specify the number of bytes per packet to be sent.": "ping -l",
"Enter the command that pings 192.168.0.1 packets the size of 1500.": "ping -l 1500 192.168.0.1",
"Enter the command that resolves address to hostnames.": "ping -a",
"Enter the command that forces the use of IPv4 and results in IPv4-based data.": "ping -4",
"Enter the command that forces the use of IPv6 and results in IPv6-based data.": "ping -6",
"Enter the command that sends 450 pings, each 1500 bytes in size, to 192.168.0.1": "ping -n 450 -l 1500 192.168.0.1",
"Windows command-line utility used to follow the path a packet takes between two hosts. The utility is traceroute in macOS and Linux.": "tracert",
"Command-line tool in Windows and Linux to identify inbound and outbound TCP/IP connections with the host.": "netstat",
"Command-line program in Windows used to determine exactly what information the DNS server is providing about a specific host name.": "nslookup",
"Command-line utility in Windows that enables users to view and change a whole host of network settings and information.": "net",
"Enter the command to create an account.": "net user /add"
}