{
"What is the module format for a stick of SODIMM DDR4 RAM?": ["1.8-inch", "204-pin", "*260-pin", "2.5-inch", "None of the listed"],
"You just added a second memory module to a laptop. However, after rebooting the system, the OS reports the same amount of memory as before. What should you do next?": ["Replace both memory modules.", "Run Windows Update.", "Replace the motherboard.", "*Reseat the laptop memory.", "None of the listed"],
"One of your customers reports that she walked away from her laptop for 30 minutes, and when she returned, the display was very dim. She increased the brightness setting and moved the mouse but to no effect. What should you do first?": ["Replace the LCD screen.", "Check the operating system for corruption.", "Connect an external monitor to verify that the video card works.", "*Check whether the laptop is now on battery power.", "None of the listed"],
"You are helping a customer with a laptop issue. The customer says that two days ago the laptop was accidentally dropped while it was charging. You observe that the laptop will not turn on and that it is connected to the correct power adapter. Which of the following is the most likely cause?": ["The battery", "The power adapter", "The storage drive", "*The DC jack", "The BIOS/UEFI"],
"You want to reduce the risk of your laptop being stolen. Which of the following is the best option?": ["Incorporate biometrics", "Disable NFC", "*Use a cable lock, Enable MFA", "None of the listed"],
"A user cannot make contactless payments using NFC, connect to the Internet, or send/receive calls from their mobile device. The user is able to boot the device and sign on. Which of the following is most likely the cause of the problem?": ["Failed power-down state", "*Airplane mode", "Biometric authentication", "ESD has occurred", "None of the listed"],
"Which kind of video technology do most laptop LCDs use?": ["*TFT active matrix", "Passive matrix", "OLED", "MAC ID", "None of the listed"],
"Which of the following uses an organic compound that emits light?": ["TFT active matrix", "IPS", "*OLED", "LCD", "LED"],
"Which of the following allows you to access a WLAN?": ["LED", "Webcam", "Digitizer", "Stylus", "*Wi-Fi card"],
"You have been tasked with replacing a Wi-Fi/Bluetooth card in a laptop. You open the laptop and find a card that uses the 2230 standard. What type of card is this?": ["Mini PCIe", "*M.2", "Digitizer, RJ45", "None of the listed"],
"Which type of charging connector would you find on an iPad?": ["Micro-USB", "*Lightning", "Thunderbolt", "IP68", "None of the listed"],
"You are required to add long-term storage to a smartphone. Which type would you most likely add?": ["DDR4", "*microSD", "LPDDR4", "SSD", "SIM"],
"The organization you work for allows employees to work using their own mobile devices in a BYOD manner. You have been tasked with setting up the devices so that they can “beam” information back and forth between each other. What is this known as?": ["Mobile hotspot", "IoT", "CYOD", "IR", "*NFC"],
"Which of the following can be useful in areas where a smartphone has cellular access but a PC (or laptop) cannot connect to the Internet?": ["Proprietary vendor-specific connector", "Accessories", "IP codes", "*Tethering", "None of the listed"],
"A user has asked you to provide her with a more accurate way of manipulating her smartphone screen. She is part of a mobile sales force and needs to be able to work quickly and efficiently. Which of the following is the easiest and best solution?": ["Connect an external monitor so that the images on the screen will be bigger.", "Configure a drawing pad to work with the smartphone.", "*Set up a touch pen to access the screen directly.", "Add an external touchpad to the device.", "None of the listed"],
"Which protocol uses port 22?": ["FTP", "Telnet", "*SSH", "HTTPS", "None of the listed"],
"Which of these would be used for streaming media?": ["TCP", "RDP", "*UDP", "DHCP", "All of the listed"],
"Which ports are used by the IMAP protocol?": ["53 and 68", "80 and 443", "110 and 995", "*143 and 993", "None of the listed"],
"A user can receive email but cannot send any. Which protocol is not configured properly?": ["POP3", "FTP", "*SMTP", "SNMP", "None of the listed"],
"Which of the following is the default inbound port of a DHCPv4 server?": ["*67", "22", "995", "3389", "None of the listed"],
"What device protects a network from unwanted intrusion?": ["Switch", "Router", "Access point", "*Firewall", "All of the listed"],
"Which of the following network devices moves frames of data between a source and destination, based on their MAC addresses?": ["Hub", "*Switch", "Router", "Modem", "None of the listed"],
"Which of the following network devices allows a remote device to obtain Ethernet data as well as electrical power?": ["PD", "*PoE injector", "Firewall", "Router", "None of the listed"],
"Which of the following devices can be configured when accessed from a browser or SSH or similar configuration tool?": ["*Managed switch", "Unmanaged switch", "Patch panel", "Network interface card", "None of the listed"],
"Which of the following acts as a demarcation point for fiber optic services?": ["SDN", "*ONT", "Patch panel", "NIC", "None of the listed"],
"Which of the following would a company most likely use for authentication to a server room?": ["802.11ac", "Fixed wireless", "*RFID", "MIMO", "None of the listed"],
"Which standard can attain a data transfer rate of 1 Gbps over a wireless connection?": ["802.11a", "802.11b", "802.11g", "*802.11ac", "802.3ab"],
"Which of the following is often broken down into groups of channels including 1–5, 6–10, and 11?": ["802.11ac", "*2.4 GHz", "5 GHz", "802.11a", "None of the listed"],
"You are servicing a customer with a cable broadband Internet connection and an 802.11ac wireless network that is experiencing interference from a nearby office. The customer’s WAP is mounted to the ceiling. Which of the following is the easiest and best solution?": ["Move the wireless access point to another location.", "Reconfigure the WAP to use 2.4 GHz instead of 5 GHz.", "*Change the broadcasting channel on the WAP to one that is not used by any neighbors.", "Recommend a long-range fixed wireless service.", "None of the listed"],
"Which wireless system is composed of readers and tags and can be used for access control, commerce, advertising, manufacturing, and agriculture?": ["802.11ax", "Wi-Fi 6", "*RFID", "FCC", "None of the listed"],
"While looking at the details of a server in your provider’s control panel, you notice that it says “Apache” in the HTTP summary. What kind of server is this?": ["File server", "*Web server", "Email server", "Authentication server", "None of the listed"],
"Which type of server acts as a go-between for clients and websites?": ["*Proxy server", "Print server", "Syslog server", "DHCP server", "None of the listed"],
"Which type of server runs Microsoft Exchange?": ["File server", "Authentication server", "*Email server", "Web server", "SCADA"],
"Which type of device category would a smart thermostat fall under?": ["SCADA", "*IoT", "Load balancer", "Spam gateway", "None of the listed"],
"You have been tasked with installing a solution that will proactively prevent Internet attacks from reaching the LAN. Which of the following devices is the best solution?": ["Proxy server", "IDS", "Authentication server", "*IPS", "None of the listed"],
"Which of these addresses needs to be configured to enable a computer access to the Internet or to other networks?": ["Subnet mask", "*Gateway address", "DNS address", "MAC address", "None of the listed"],
"Which technology assigns addresses on the 169.254.0.0 network?": ["DHCP", "Static IP", "*APIPA", "Class B", "None of the listed"],
"You want to test the local loopback IPv6 address. Which address would you use?": ["127.0.0.1", "*::1", "FE80::/10", "::0", "None of the listed"],
"Which of the following IP addresses would you configure so that the computer can take advantage of hostname-to-IP address resolution?": ["127.0.0.1 (local loopback)", "192.168.0.1 (gateway)", "*8.8.8.8 (DNS)", "255.255.255.0 (subnet mask)", "All of the listed"],
"Of the following, which is a common use for NAT?": ["Defining the network portion of an IPv4 address", "*Connecting multiple computers using a single public IP address", "Resolving hostnames to IP addresses", "Automatically assigning TCP/IP addresses", "None of the above"],
"Your system needs to renew its IP address from a DHCP server. What has expired?": ["*IP lease", "IP reservation", "DHCP scope", "MAC address", "None of the listed"],
"Which type of DNS record associates an IPv6 address with a hostname?": ["A", "*AAAA", "SOA", "MX", "None of the listed"],
"Which of the following is the best solution for protecting email domains against spoofing and other unauthorized uses?": ["SPF", "DORA", "*DMARC", "VLAN", "None of the listed"],
"You have been tasked with compartmentalizing a network. Which of the following technologies should you use?": ["APIPA", "VPN", "*VLAN", "IPv6", "None of the listed"],
"Which of the following DNS record types directs email to an email server?": ["A", "AAAA", "TXT", "*MX", "None of the listed"],
"Which of the following is a group of Windows desktop computers located in a small area?": ["*LAN", "WAN", "PAN", "MAN", "None of the listed"],
"What kind of cable and connector are used with cable Internet service to connect to the customer’s “modem”?": ["Twisted pair and RJ11", "802.11ax and antenna", "Fiber and ST", "*RG-6 and F-connector", "None of the listed"],
"Which of the following might make use of Fibre Channel connections?": ["WAN", "*SAN", "DSL", "Cable Internet", "WISP"],
"Which tool is used to test a network adapter without a network connection?": ["Punchdown tool", "Cable tester", "*Loopback plug", "Tone generator and probe", "None of the listed"],
"Your boss is concerned about overlapping wireless networks from neighboring companies using 802.11ac. Which tool should you use to analyze the problem, and which frequency should you display for analysis": ["*Wi-Fi analyzer; 5 GHz", "Cable certifier; 5 GHz", "Loopback plug; 2.4 GHz", "Wi-Fi analyzer; 2.4 GHz", "None of the listed"],
"What would be required to attach RJ45 plugs to the ends of a single patch cable?": ["Tone and probe kit", "Multimeter", "Cable stripper", "*Crimper", "None of the listed"],
"Your organization is terminating Category 6 cable to a 110 block. Which of the following tools should you use to perform the task?": ["*Punchdown tool", "Crimper", "Cable stripper", "Tone generator", "None of the listed"],
"Say that you are responsible for the network security of your organization. You decide to perform packet sniffing on your switch by using Wireshark. Which of the following tools will help you to do this?": ["Tone and probe kit", "*Network tap", "Wireless analyzer", "Loopback plug", "None of the listed"],
"Which of the following uses a 7-pin data connector and a 15-pin power connector?": ["VGA", "IDE", "*SATA", "Molex", "Cat 6"],
"Which type of cable would you use if you were concerned about EMI?": ["Plenum rated", "UTP", "*STP", "Coaxial", "None of the listed"],
"You have been tasked with connecting a newer Android smartphone to an external TV so that you can display the CEO’s smartphone screen during a meeting. Which of the following adapters would typically be the best solution?": ["Micro-USB to HDMI", "Micro-USB to DVI", "USB-C to DVI", "USB-C to Ethernet", "*USB-C to HDMI"],
"Which type of cable can connect a computer to another computer directly": ["Straight-through", "*Crossover", "568A", "SATA", "568B"],
"Which connector is used for cable Internet?": ["LC", "*F-connector", "Direct burial", "RJ45", "DE-9"],
"Which cable type would be suitable for longer distances, such as connecting two cities?": ["Coaxial", "Twisted pair", "Multimode fiber", "*Single-mode fiber", "None of the listed"],
"You need to make a high-speed connection to an external storage device that can handle 40 Gbps. Which of the following is the best solution?": ["USB 3.2", "*Thunderbolt", "HDMI", "Cat 6a", "None of the listed"],
"What is the transfer rate of DDR4-2133?": ["*17,066 MB/s", "19,200 MB/s", "21,333 MB/s", "25,600 MB/s", "None of the listed"],
"Which of the following technologies allows for a 256-bit-wide bus?": ["ECC", "*Quad-channel", "Virtual RAM", "Task Manager", "None of the listed"],
"A technician has installed dual-inline memory modules that each have 288-pins and use 1.1 V. What kind of RAM has the tech installed?": ["DDR4 DIMMs", "DDR3 DIMMs", "DDR4 SODIMMs", "*DDR5 DIMMs", "None of the listed"],
"How much data can a SATA Revision 3.0 drive transfer per second?": ["50 MB/s", "90 MB/s", "1969 MB/s", "*6 Gb/s", "16 Gb/s"],
"Which level of RAID stripes data and parity across three or more disks?": ["RAID 0", "RAID 1", "*RAID 5", "Striping", "RAID 10"],
"A customer complains that an important disc is stuck in the system’s Blu-ray drive. What should you recommend to the customer?": ["Get a screwdriver and disassemble the drive.", "Format the disc.", "*Use a paper clip to eject the tray.", "Dispose of the drive and replace the media."],
"Which of the following best describes a specification for accessing storage while using PCI Express?": ["*NVMe", "7200 RPM", "Hot-swappable", "3.5-inch and 2.5-inch", "None of the listed"],
"Which motherboard form factor measures 12 inches × 9.6 inches (305 mm × 244 mm)?": ["microATX", "SATA", "*ATX", "mITX", "None of the listed"],
"Which component supplies power to the CMOS when a computer is off?": ["*Lithium battery", "POST", "Power supply", "BIOS/UEFI", "None of the listed"],
"To implement a Secure Boot process, which device should be listed first in the Boot Device Priority screen?": ["Network", "CD-ROM", "USB", "*Hard drive", "None of the listed"],
"Which of the following connectors would you use to power a video card?": ["24-pin power", "*8-pin PCIe", "Molex", "3.5-mm TRS", "None of the listed"],
"Which of the following is a chip that stores encryption keys?": ["Intel VT", "Secure Boot", "Firmware", "*TPM", "None of the listed"],
"Which of the following BIOS/UEFI settings are used to prevent USB drop attacks?": ["Boot password", "BIOS time/date", "Secure Boot", "SAN settings", "*Configure USB permissions"],
"What do the POWER LED, POWER SW, and HDD LED plugs connect to on the motherboard?": ["*Headers", "SATA 7-pin", "PCIe slots", "24-pin ATX port", "None of the listed"],
"What does multithreading do?": ["It gives you multiple cores within the CPU.", "It enables four simultaneous threads to be processed by one CPU core.", "*It enables two simultaneous threads to be processed by one CPU core.", "It provides a high-speed connection from the CPU to RAM.", "None of the listed"],
"What seals the tiny gaps between the CPU cap and the heat sink?": ["Grape jelly", "Plumber’s putty", "3-in-1 house oil", "*Thermal paste", "None of the listed"],
"Which of the following can be defined as the amount of heat generated by the CPU, which the cooling system is required to dissipate?": ["GPU", "*TDP", "PSU", "140 watts", "None of the listed"],
"When deciding on a CPU for use with a specific motherboard, what does it need to be compatible with?": ["Case", "*Socket", "Wattage range", "PCIe slots", "None of the listed"],
"Which kind of socket incorporates “lands” to ensure connectivity to a CPU?": ["PGA", "Chipset", "*LGA", "Copper", "AM4"],
"Which of the following enables the user to increase the base clock within the BIOS, thereby increasing the clock speed of the CPU?": ["*Overclocking", "L3 cache", "Integrated GPU", "Heat sink", "None of the listed"],
"Which of the following would you use if you needed a typical CPU for a PC that can access 16 GB of RAM?": ["ARM", "*x86-64", "RISC", "x86", "None of the listed"],
"A technician needs to install a new server system in a datacenter that can run more than one physical CPU at a time. Which configuration will support this requirement?": ["Single-core", "Multi-core", "Multithreading", "*Multisocket", "None of the listed"],
"Which power connector should be used to connect directly to a SATA storage drive? (Select the best answer.)": ["Molex", "6-pin", "24-pin", "*15-pin", "None of the listed"],
"Which voltages are supplied by a Molex power connector?": ["*12 V and 5 V", "5 V and 3.3 V", "3.3 V and 1.5 V", "24 V and 12 V", "None of the listed"],
"A company salesperson just returned to the United States after three months in Europe. Now the salesperson tells you that her PC, which worked fine in Europe, won’t turn on. What is the best solution?": ["Install a new power supply.", "The computer will not work in the United States due to European licensing.", "Install a power inverter to the power supply.", "*Change the voltage from 230 to 115.", "None of the listed"],
"Where would you go in Windows to enable printer sharing?": ["Network Connections", "*Network and Sharing Center", "The printer’s OCP", "Bonjour", "None of the listed"],
"Your printer supports printing to both sides of a piece of paper. What should you enable in the Printing preferences to print on both sides?": ["Collate", "Orientation", "*Duplex", "Quality", "None of the listed"],
"A technician is setting up a printer for a customer who prints professional graphics and presentations. Which print driver should be installed?": ["PCL", "ADF", "SMB", "*PostScript", "None of the listed"]
}